In [1]:
import pandas as pd
import seaborn as sns

titanic = sns.load_dataset('titanic')
titanic.head(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True

In [2]:
titanic['survived'].unique()

array([0, 1], dtype=int64)

In [3]:
titanic['sex'].unique()

array(['male', 'female'], dtype=object)

In [4]:
q5_survived_cnt = titanic[titanic['survived']==1]
q5_survived_cnt.groupby('sex')['survived'].count()

sex
female    233
male      109
Name: survived, dtype: int64

In [6]:
# and 는
age0 = titanic[(titanic['age']>=0) & (titanic['age']<10)]
age1 = titanic[(titanic['age']>=10) & (titanic['age']<20)]
age2 = titanic[(titanic['age']>=20) & (titanic['age']<30)]
age3 = titanic[(titanic['age']>=30) & (titanic['age']<40)]
age4 = titanic[(titanic['age']>=40) & (titanic['age']<50)]
age5 = titanic[(titanic['age']>=50) & (titanic['age']<60)]
age6 = titanic[(titanic['age']>=60) & (titanic['age']<70)]
age7 = titanic[(titanic['age']>=70) & (titanic['age']<80)]

print('0~10대 사망자수 :',len(age0['survived']==0))
print('10~20대 사망자수 :',len(age1['survived']==0))
print('20~30대 사망자수 :',len(age2['survived']==0))
print('30~40대 사망자수 :',len(age3['survived']==0))
print('40~50대 사망자수 :',len(age4['survived']==0))
print('50~60대 사망자수 :',len(age5['survived']==0))
print('60~70대 사망자수 :',len(age6['survived']==0))
print('70~80대 사망자수 :',len(age7['survived']==0))

0~10대 사망자수 : 62
10~20대 사망자수 : 102
20~30대 사망자수 : 220
30~40대 사망자수 : 167
40~50대 사망자수 : 89
50~60대 사망자수 : 48
60~70대 사망자수 : 19
70~80대 사망자수 : 6